КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ДвижениеДокументооборота/КонтурЛогистика_ДвижениеДокументооборота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ДвижениеДокументооборота</name>
  <comment>время периода по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <comment>kl-status из сервиса: Титул.CustomData</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлОбмена</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ФайлыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналТранспорта</name>
    <type>
      <types>EnumRef.КонтурЛогистика_КаналыТранспорта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_ЗаявкаНаМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул1</name>
    <comment>Поручение экспедитору (ПЭ). Титул1 (ON_POREXPKLT)</comment>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул2</name>
    <comment>Поручение экспедитору (ПЭ). Титул2 (подтверждение)</comment>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/ТранспортнаяНакладная/ТранспортнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТранспортнаяНакладная</name>
  <attributes>
    <name>АвтомобильВместимостьВКубическихМетрах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильГосударственныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильГрузоподъемностьВТоннах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПогрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПогрузкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетЗаказчикаПеревозки</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПлательщика</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПеревозчика</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводДанныхОТоварномСоставе</name>
    <type>
      <types>EnumRef.ВариантыВыводаДанныхОТоварномСоставе</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйНомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьВыдана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказчикПеревозки</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионнаяКарточкаВид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионнаяКарточкаНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионнаяКарточкаРегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионнаяКарточкаСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отпустил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтпустилДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдостоверениеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдостоверениеСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчикаЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПогрузкиЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.ОтгрузкаТоваровСХранения</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
        <types>DocumentRef.ПередачаСырьяПереработчику</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ИнтеграцияТиповыеСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура Документ_ПриСозданииНаСервере(Форма) Экспорт
	
	РодительГруппы = РодительГруппыПоТипуКонфигурацииИДокументу(Форма);
	
	// Скрываем команды в формах учетных документах, в которых нет дополнительной панели
	НастроитьОтображениеКомандЛогистикиДляФормДокументов(Форма);
	
	Если РодительГруппы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОтображениеПанелиВключеноВНастройках(Форма, "ОтображатьПанельВУчетныхДокументах_СтараяВерсия") Тогда
		Возврат;
	КонецЕсли;
	
	// Скрываем все команды, которые после создания дополнительной панели не нужны в учетных документах
	СкрытьКомандыЛогистики(Форма);
	
	// Создаем необходимые реквизиты
	СформироватьРеквизитыФормы(Форма);
	
	// Получим данные для отображения (видимости)
	ЗаполнитьВспомогательныеДанные(Форма);
	
	// Создаем представление созданных документов и органы управления
	СформироватьПредставлениеДокументов(Форма, РодительГруппы);
	
КонецПроцедуры

Функция ИменаИнтегрируемыхДокументов(ТипКонфигурации) Экспорт
	
	ИнтегрируемыеДокументы = Новый Массив;
	
	Если ТипКонфигурации = "УФ_БП" Тогда
		
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Возврат товаров поставщику",			"ВозвратТоваровПоставщику"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Поступление (акты, накладные, УПД)",	"ПоступлениеТоваровУслуг"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Перемещение товаров, материалов",		"ПеремещениеТоваров"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Реализация (акты, накладные, УПД)",	"РеализацияТоваровУслуг"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Путевой лист",						"ПутевойЛист"));
		
	ИначеЕсли ТипКонфигурации = "ERP"
		Или ТипКонфигурации = "УФ_УТ"
		Или ТипКонфигурации = "КА_2" Тогда
		
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Возврат товаров поставщику",		"ВозвратТоваровПоставщику"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Задание на перевозку",			"ЗаданиеНаПеревозку"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Перемещение товаров",				"ПеремещениеТоваров"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Поступление товаров на склад",	"ПоступлениеТоваровНаСклад"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Приобретение товаров и услуг",	"ПриобретениеТоваровУслуг"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Реализация товаров и услуг",		"РеализацияТоваровУслуг"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Транспортная накладная",			"ТранспортнаяНакладная"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Поручение экспедитору",			"ПоручениеЭкспедитору"));
			
	ИначеЕсли ТипКонфигурации = "УАТ_ПРОФ"
		Или ТипКонфигурации = "УАТ"
		Или ТипКонфигурации = "ТЛЭ"
		Или ТипКонфигурации = "ERP_УАТ" Тогда
		
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Заказ на ТС",		"уатЗаказГрузоотправителя"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Маршрутный лист", "уатМаршрутныйЛист"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Путевой лист",	"уатПутевойЛист"));
		
		Если ТипКонфигурации = "УАТ_ПРОФ"
			Или ТипКонфигурации = "ТЛЭ"
			Или ТипКонфигурации = "ERP_УАТ" Тогда
			
			ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Заказ перевозчику", 									"уатЗаказПеревозчику_уэ"));
			ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Журнал медицинского осмотра водителей", 				"уатЖурналМедицинскогоОсмотраВодителей"));
			ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Журнал предрейсового и послерейсового контроля ТС",	"уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС"));
			
		КонецЕсли;
		
		Если ТипКонфигурации = "УАТ_ПРОФ"
			Или ТипКонфигурации = "ТЛЭ" Тогда
			
			ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Журнал учета показаний одометра", 					"уатЖурналУчетаПоказанийОдометра"));
			
		КонецЕсли;
				
	ИначеЕсли ТипКонфигурации = "УФ_УНФ" Тогда
		
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Перемещение запасов", "ПеремещениеЗапасов"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Приходная накладная", "ПриходнаяНакладная"));
		ИнтегрируемыеДокументы.Добавить(МанифестИнтеграционногоДокумента("Расходная накладная", "РасходнаяНакладная"));
		
	КонецЕсли;
	
	Возврат ИнтегрируемыеДокументы;
	
КонецФункции

Функция ПрефиксНастройкиОтображенияПанели() Экспорт
	
	Возврат "ОтображатьПанельВ";
	
КонецФункции

Функция ИмяДополнительногоРасширенияПоИмениКонфигурации(ТипКонфигурации) Экспорт
	
	Если ТипКонфигурации = "УФ_БП"
		Или ТипКонфигурации = "ERP"
		Или ТипКонфигурации = "УФ_УТ"
		Или ТипКонфигурации = "КА_2"
		Или ТипКонфигурации = "УАТ_ПРОФ"
		Или ТипКонфигурации = "УАТ"
		Или ТипКонфигурации = "ТЛЭ"
		Или ТипКонфигурации = "ERP_УАТ"
		Или ТипКонфигурации = "УФ_УНФ" Тогда
		
		Возврат "РасширениеКонтурЛогистика_Дополнение";
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция ИмяНастройкиОтображенияПанелиПоИмениФормы(ИмяФормы) Экспорт
	
	ТекущееИмяФормы = СтрЗаменить(ИмяФормы, "Документ.", "");
	
	Индекс = Найти(ТекущееИмяФормы, ".");
	
	Если Индекс = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяДокумента = Лев(ТекущееИмяФормы, Индекс - 1);
	
	ИмяНастройки = ПрефиксНастройкиОтображенияПанели() + ИмяДокумента;
	
	Возврат ИмяНастройки;
	
КонецФункции

Функция ВведенныеДокументы(ДокументОснование) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура();
	Результат.Вставить("Документ1", Новый Структура("Ссылка, Номер, Дата, Состояние"));
	Результат.Вставить("Документ2", Новый Структура("Ссылка, Номер, Дата, Состояние"));
	Результат.Вставить("ДокументовЕще", 0);
	Результат.Вставить("ВсеСсылки", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН КАК Ссылка,
	|	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН.НомерТрН КАК Номер,
	|	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН.ДатаТрН КАК Дата
	|ПОМЕСТИТЬ Документы
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул1.ДокументОснование = &ДокументОснование
	|	И НЕ КонтурЛогистика_ТрН_Титул1.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка,
	|	КонтурЛогистика_ПЛ_Титул1.НомерПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.ДатаПЛ
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул1 КАК КонтурЛогистика_ПЛ_Титул1
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул1.ДокументОснование = &ДокументОснование
	|	И НЕ КонтурЛогистика_ПЛ_Титул1.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул1.Ссылка,
	|	КонтурЛогистика_ЗЗ_Титул1.НомЗак,
	|	КонтурЛогистика_ЗЗ_Титул1.ДатаЗак
	|ИЗ
	|	Документ.КонтурЛогистика_ЗЗ_Титул1 КАК КонтурЛогистика_ЗЗ_Титул1
	|ГДЕ
	|	КонтурЛогистика_ЗЗ_Титул1.ДокументОснование = &ДокументОснование
	|	И НЕ КонтурЛогистика_ЗЗ_Титул1.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	ЕСТЬNULL(КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние, ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик)) КАК Состояние
	|ИЗ
	|	Документы КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_ДвижениеДокументооборота.СрезПоследних(
	|				,
	|				Документ В
	|					(ВЫБРАТЬ
	|						Документы.Ссылка КАК Ссылка
	|					ИЗ
	|						Документы КАК Документы)) КАК КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних
	|		ПО Документы.Ссылка = КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Счет = 0;
	Пока Выборка.Следующий() Цикл
		
		Счет = Счет + 1;
		
		Если Счет = 1 Или Счет = 2 Тогда
			
			Данные = Результат["Документ" + Формат(Счет, "ЧДЦ=0; ЧГ=")];
			ЗаполнитьЗначенияСвойств(Данные, Выборка);
			
		Иначе
			
			Результат.ДокументовЕще = Результат.ДокументовЕще + 1;
			
		КонецЕсли;
		
		Результат.ВсеСсылки.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеДокумента(ТекущийДокумент) Экспорт
	
	Если ТипЗнч(ТекущийДокумент.Ссылка) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1") Тогда
		ПредставлениеТипаДокумента = "ПЛ";
	ИначеЕсли ТипЗнч(ТекущийДокумент.Ссылка) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1") Тогда
		ПредставлениеТипаДокумента = "ЗЗ";
	Иначе
		ПредставлениеТипаДокумента = "ЭТрН";
	КонецЕсли;
	
	ЗаголовокДокумент = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
		"%1 %2 от %3 (%4)",
		ПредставлениеТипаДокумента,
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УдалитьЛидирующиеНули(ТекущийДокумент.Номер),
		Формат(ТекущийДокумент.Дата, "ДФ=dd.MM.yyyy"),
		ТекущийДокумент.Состояние);
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ТекущийДокумент.Ссылка);
	
	ПредставлениеДокумента = Новый ФорматированнаяСтрока(ЗаголовокДокумент,, ЦветаСтиля.ЦветТекстаФормы,, НавигационнаяСсылка);
	
	Возврат ПредставлениеДокумента;
	
КонецФункции

Функция ПолучитьНастройкуКонвертации(ТипДокументаЛогистика, ТипДокумента1С = Неопределено) Экспорт
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		ТипДокументаЛогистика, ТипДокумента1С);
	
КонецФункции

Функция ПризнакОтображатьПанельВУчетныхДокументах() Экспорт
	
	НастройкаОтображатьПанельВУчетныхДокументах = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
		"ИмяПредопределенногоДляРасширения", "ОтображатьПанельВУчетныхДокументах");
	Если НастройкаОтображатьПанельВУчетныхДокументах.Пустая() Тогда
		
		// Группа настроек
		ГруппаНастроек = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
			"ИмяПредопределенногоДляРасширения", "НастройкиОтображенияПанелиВУчетныхДокументах");
		Если ГруппаНастроек.Пустая() Тогда
			НоваяГруппа = Справочники.КонтурЛогистика_Настройки.СоздатьГруппу();
			НоваяГруппа.Наименование = "Настройки отображения панели в учетных документах";
			НоваяГруппа.ИмяПредопределенногоДляРасширения = "НастройкиОтображенияПанелиВУчетныхДокументах";
			НоваяГруппа.Записать();
			
			ГруппаНастроек = НоваяГруппа.Ссылка;
			
			// Добавим настройки по документам
			СоздатьНастройкиОтображенияУчетныхДокументовВРасширении();
		КонецЕсли;
		
		// Признак отображения
		НовыйЭлемент = Справочники.КонтурЛогистика_Настройки.СоздатьЭлемент();
		НовыйЭлемент.Родитель = ГруппаНастроек;
		НовыйЭлемент.Наименование = "Отображать панель";
		НовыйЭлемент.ИмяПредопределенногоДляРасширения = "ОтображатьПанельВУчетныхДокументах";
		НовыйЭлемент.ТипЗначения = "Булево";
		НовыйЭлемент.Значение = Неопределено;	// Дадим пользователю самому решать и при старте рабочего стола спросим
		НовыйЭлемент.Описание = "Включает/выключает отображение панели статусов и действий в документах учетной системы. "
			+ "Видимость панели для каждого документа можно настроить отдельно.";
		НовыйЭлемент.Записать();
		
		НастройкаОтображатьПанельВУчетныхДокументах = НовыйЭлемент.Ссылка;
		
	КонецЕсли;
	
	Возврат НастройкаОтображатьПанельВУчетныхДокументах.Значение;
	
КонецФункции

Процедура СоздатьНастройкиОтображенияУчетныхДокументовВРасширении() Экспорт
	
	ИмяКонфигурации1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяКонфигурации1С");
	
	// Проверяем наличие настроек для каждого типа документов
	ИнтегрируемыеДокументы = КонтурЛогистика_ИнтеграцияТиповыеСервер.ИменаИнтегрируемыхДокументов(ИмяКонфигурации1С);
	
	Если ИнтегрируемыеДокументы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаНастроек = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
		"ИмяПредопределенногоДляРасширения", "НастройкиОтображенияПанелиВУчетныхДокументах");
	Если ГруппаНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаНастроекПоДокументам = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
		"ИмяПредопределенногоДляРасширения", "НастройкиОтображенияПанелиПоДокументам");
	Если ГруппаНастроекПоДокументам.Пустая() Тогда
		НоваяГруппа = Справочники.КонтурЛогистика_Настройки.СоздатьГруппу();
		НоваяГруппа.Родитель = ГруппаНастроек;
		НоваяГруппа.Наименование = "Документы учетной системы";
		НоваяГруппа.ИмяПредопределенногоДляРасширения = "НастройкиОтображенияПанелиПоДокументам";
		НоваяГруппа.Записать();
		
		ГруппаНастроекПоДокументам = НоваяГруппа.Ссылка;
	КонецЕсли;
	
	Для Каждого ИнтегрируемыйДокумент Из ИнтегрируемыеДокументы Цикл
		ТекущаяНастройка = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
			"ИмяПредопределенногоДляРасширения", ИнтегрируемыйДокумент.ИмяПредопределенногоДляРасширения);
		
		Если Не ТекущаяНастройка.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		// Создаем новую
		НовыйЭлемент = Справочники.КонтурЛогистика_Настройки.СоздатьЭлемент();
		НовыйЭлемент.Родитель = ГруппаНастроекПоДокументам;
		НовыйЭлемент.Наименование = ИнтегрируемыйДокумент.Наименование;
		НовыйЭлемент.ИмяПредопределенногоДляРасширения = ИнтегрируемыйДокумент.ИмяПредопределенногоДляРасширения;
		НовыйЭлемент.ТипЗначения = "Булево";
		НовыйЭлемент.Значение = Истина;
		НовыйЭлемент.Описание = ИнтегрируемыйДокумент.Описание;
		НовыйЭлемент.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьНастройкуДляДополнительногоРасширения() Экспорт
	
	ГруппаНастроек = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
		"ИмяПредопределенногоДляРасширения", "НастройкиОтображенияПанелиВУчетныхДокументах");
	Если ГруппаНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяНастройки = "ОтображатьПанельВУчетныхДокументах_СтараяВерсия";
	
	ТекущаяНастройка = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", ИмяНастройки);
	Если ТекущаяНастройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Создаем новую
	НовыйЭлемент = Справочники.КонтурЛогистика_Настройки.СоздатьЭлемент();
	НовыйЭлемент.Родитель = ГруппаНастроек;
	НовыйЭлемент.Наименование = "Отображать панель (старая версия)";
	НовыйЭлемент.ИмяПредопределенногоДляРасширения = ИмяНастройки;
	НовыйЭлемент.ТипЗначения = "Булево";
	НовыйЭлемент.Значение = Истина;
	НовыйЭлемент.Описание = "Включает/выключает отображение панели статусов и действий в документах учетной системы (старая версия). "
		+ "Видимость панели для каждого документа можно настроить отдельно.";
	НовыйЭлемент.Записать();
	
КонецПроцедуры

Функция ОтображениеПанелиВключеноВНастройках(Форма, ИмяНастройкиОтображения = "ОтображатьПанельВУчетныхДокументах") Экспорт
	
	Результат = Истина;
	
	Попытка
		Результат = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(ИмяНастройкиОтображения);
		Если Результат = Неопределено Тогда
			Результат = Ложь;
		КонецЕсли;
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	Если Не Результат Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИмяНастройки = ИмяНастройкиОтображенияПанелиПоИмениФормы(Форма.ИмяФормы);
	
	Если ИмяНастройки = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Результат = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(ИмяНастройки);
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СкрытьКомандыЛогистики(Форма)
	
	ИменаСкрываемыхКоманд = Новый Массив;
	ИменаСкрываемыхКоманд.Добавить("УчетнаяСистема_КопироватьУчетныеДокументы");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ВыполнитьДействияПоУмолчанию");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ОтправитьНеподписанный");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПодготовитьНеподписанныйКОтправке");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПодписатьИОтправить");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПодписатьИПодготовитьКОтправке");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПропуститьДокумент");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_СоздатьЧерновик");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_Создать1ТрнПоВыделенным");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_Создать1ПлПоВыделенным");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПередатьНаПодписание");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПередатьНаСогласованиеВодителю");
	
	Если Не ЕстьНастройкаКонвертацииДляЭТРН() Тогда
		ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_РаспечататьТранспортнуюНакладную");
		ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПоказатьПечатнуюФормуТранспортнойНакладной");
	КонецЕсли;
	
	Для Каждого ТекущееИмяКоманды Из ИменаСкрываемыхКоманд Цикл
		ОтключитьВидимостьКоманды(Форма, ТекущееИмяКоманды);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтключитьВидимостьКоманды(Форма, ИмяКоманды)
	
	Если ИмяКоманды = "КонтурЛогистика_КомандыВводаДокументов" Тогда
		ИмяЭлемента = "Форма" + ИмяКоманды;
	Иначе
		ИмяЭлемента = "ФормаОбщаяКоманда" + ИмяКоманды;
	КонецЕсли;
	
	НайденныйЭлемент = Форма.Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьОтображениеКомандЛогистикиДляФормДокументов(Форма)
	
	ИмяФормы = Форма.ИмяФормы;
	
	ТиповаяКонфигурацияСтрока = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	Если ТиповаяКонфигурацияСтрока = "УФ_БП" Тогда
		
		Если ИмяФормы = "Документ.ВозвратТоваровПоставщику.Форма.ФормаСписка"
			Или ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаСписка"
			Или ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаОбщая"
			Или ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаУслуги"
			Или ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаТопливо"
			Или ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаАренда"
			Или ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаОсновныеСредства"
			Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаСписка"
			Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокументаОбщая"
			Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокументаУслуги"
			Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокументаСтроительныеРаботы"
			Или ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаСписка" Тогда
			
			СкрытьКомандыЛогистикиНаФормеСписка(Форма);
			
		КонецЕсли;
		
	ИначеЕсли ТиповаяКонфигурацияСтрока = "ERP"
		Или ТиповаяКонфигурацияСтрока = "УФ_УТ"
		Или ТиповаяКонфигурацияСтрока = "КА_2" Тогда
		
		Если ИмяФормы = "Документ.ВозвратТоваровПоставщику.Форма.ФормаСписка"
			Или ИмяФормы = "Документ.ЗаданиеНаПеревозку.Форма.ФормаСписка"
			Или ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаСписка"
			Или ИмяФормы = "Документ.ПоступлениеТоваровНаСклад.Форма.ФормаСписка"
			Или ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаСписка"
			Или ИмяФормы = "Документ.ТранспортнаяНакладная.Форма.ФормаСписка"
			Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаСписка"
			Или ИмяФормы = "Документ.ПоручениеЭкспедитору.Форма.ФормаСписка" Тогда
			
			СкрытьКомандыЛогистикиНаФормеСписка(Форма);
			
		КонецЕсли;
					
	ИначеЕсли ТиповаяКонфигурацияСтрока = "УАТ_ПРОФ"
		Или ТиповаяКонфигурацияСтрока = "УАТ"
		Или ТиповаяКонфигурацияСтрока = "ТЛЭ"
		Или ТиповаяКонфигурацияСтрока = "ERP_УАТ" Тогда
		
		ВозможныеИменаФорм = Новый Массив();
		ВозможныеИменаФорм.Добавить("Документ.уатЗаказГрузоотправителя.Форма.ФормаДокумента");
		ВозможныеИменаФорм.Добавить("Документ.уатПутевойЛист.Форма.ФормаДокумента");
		ВозможныеИменаФорм.Добавить("Документ.уатМаршрутныйЛист.Форма.ФормаДокумента");
		
		Если ТиповаяКонфигурацияСтрока = "УАТ_ПРОФ"
			Или ТиповаяКонфигурацияСтрока = "ТЛЭ"
			Или ТиповаяКонфигурацияСтрока = "ERP_УАТ" Тогда
			
			ВозможныеИменаФорм.Добавить("Документ.уатЗаказПеревозчику_уэ.Форма.ФормаДокумента");
			ВозможныеИменаФорм.Добавить("Документ.уатЖурналМедицинскогоОсмотраВодителей.Форма.ФормаДокумента");
			ВозможныеИменаФорм.Добавить("Документ.уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС.Форма.ФормаДокумента");
			
		КонецЕсли;
		
		Если ТиповаяКонфигурацияСтрока = "УАТ_ПРОФ"
			Или ТиповаяКонфигурацияСтрока = "ТЛЭ" Тогда
			
			ВозможныеИменаФорм.Добавить("Документ.уатЖурналУчетаПоказанийОдометра.Форма.ФормаДокумента");
			
		КонецЕсли;
		
		Если ВозможныеИменаФорм.Найти(ИмяФормы) <> Неопределено  Тогда			
			СкрытьКомандыЛогистикиНаФормеСписка(Форма);			
		КонецЕсли;
		
	ИначеЕсли ТиповаяКонфигурацияСтрока = "УФ_УНФ" Тогда
		
		Если ИмяФормы = "Документ.ПеремещениеЗапасов.Форма.ФормаСписка"
			Или ИмяФормы = "Документ.ПриходнаяНакладная.Форма.ФормаСписка"
			Или ИмяФормы = "Документ.РасходнаяНакладная.Форма.ФормаСписка" Тогда
			
			СкрытьКомандыЛогистикиНаФормеСписка(Форма);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СкрытьКомандыЛогистикиНаФормеСписка(Форма)
	
	ИменаСкрываемыхКоманд = Новый Массив;
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_КомандыВводаДокументов");
				
	Для Каждого ТекущееИмяКоманды Из ИменаСкрываемыхКоманд Цикл
		
		ОтключитьВидимостьКоманды(Форма, ТекущееИмяКоманды);
		
	КонецЦикла;
	
	// Если нет НКД для ЭТРН, то уберем команды печати ЭТРН
	Если Не ЕстьНастройкаКонвертацииДляЭТРН() Тогда
		
		ИменаСкрываемыхКоманд = Новый Массив;
		ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_РаспечататьТранспортнуюНакладную");
		ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПоказатьПечатнуюФормуТранспортнойНакладной");
		
		Для Каждого ТекущееИмяКоманды Из ИменаСкрываемыхКоманд Цикл
		
			ОтключитьВидимостьКоманды(Форма, ТекущееИмяКоманды);
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция РодительГруппыПоТипуКонфигурацииИДокументу(Форма)
	
	РодительГруппы = Неопределено;
	
	ИмяФормы = Форма.ИмяФормы;
	
	// ОписатьРодителейГруппы("", "") -> ЭтаФорма, т.е. в корень
	
	ТиповаяКонфигурацияСтрока = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	Если ТиповаяКонфигурацияСтрока = "УФ_БП" Тогда
		
		Если ИмяФормы = "Документ.ВозвратТоваровПоставщику.Форма.ФормаДокументаОбщая" Тогда
			
			РодительГруппы = ОписатьРодителейГруппы("", "ГруппаКомментарийОтветственный");
			
		ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаТовары"
			Или ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаОбщая"
			Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокументаТовары" 
			Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокументаОбщая" Тогда
			
			РодительГруппы = ОписатьРодителейГруппы("ГруппаПодвал", "ГруппаКомментарийОтветственный");
			
		ИначеЕсли ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента" Тогда
			
			РодительГруппы = ОписатьРодителейГруппы("", "ГруппаПодвал");
			
		ИначеЕсли ИмяФормы = "Документ.ПутевойЛист.Форма.ФормаДокумента" Тогда
			
			РодительГруппы = ОписатьРодителейГруппы("", "ГруппаПодвал");
			
		КонецЕсли;
		
	ИначеЕсли ТиповаяКонфигурацияСтрока = "ERP"
		Или ТиповаяКонфигурацияСтрока = "УФ_УТ"
		Или ТиповаяКонфигурацияСтрока = "КА_2" Тогда
		
		Если ИмяФормы = "Документ.ВозвратТоваровПоставщику.Форма.ФормаДокумента"
			Или ИмяФормы = "Документ.ЗаданиеНаПеревозку.Форма.ФормаДокумента"
			Или ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента"
			Или ИмяФормы = "Документ.ПоступлениеТоваровНаСклад.Форма.ФормаДокумента"
			Или ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента"
			Или ИмяФормы = "Документ.ТранспортнаяНакладная.Форма.ФормаДокумента"
			Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
			
			РодительГруппы = ОписатьРодителейГруппы("", "");
			
		КонецЕсли;
	
	ИначеЕсли ТиповаяКонфигурацияСтрока = "УАТ_ПРОФ"
		Или ТиповаяКонфигурацияСтрока = "УАТ"
		Или ТиповаяКонфигурацияСтрока = "ТЛЭ"
		Или ТиповаяКонфигурацияСтрока = "ERP_УАТ" Тогда
		
		ВозможныеИменаФорм = Новый Массив();
		ВозможныеИменаФорм.Добавить("Документ.уатЗаказГрузоотправителя.Форма.ФормаДокумента");
		ВозможныеИменаФорм.Добавить("Документ.уатПутевойЛист.Форма.ФормаДокумента");
		
		Если ТиповаяКонфигурацияСтрока = "УАТ_ПРОФ"
			Или ТиповаяКонфигурацияСтрока = "ТЛЭ"
			Или ТиповаяКонфигурацияСтрока = "ERP_УАТ" Тогда
			
			ВозможныеИменаФорм.Добавить("Документ.уатЗаказПеревозчику_уэ.Форма.ФормаДокумента");
			ВозможныеИменаФорм.Добавить("Документ.уатЖурналМедицинскогоОсмотраВодителей.Форма.ФормаДокумента");
			ВозможныеИменаФорм.Добавить("Документ.уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС.Форма.ФормаДокумента");
			
		КонецЕсли;
		
		Если ТиповаяКонфигурацияСтрока = "УАТ_ПРОФ"
			Или ТиповаяКонфигурацияСтрока = "ТЛЭ" Тогда
			
			ВозможныеИменаФорм.Добавить("Документ.уатЖурналУчетаПоказанийОдометра.Форма.ФормаДокумента");
			
		КонецЕсли;
		
		Если ВозможныеИменаФорм.Найти(ИмяФормы) <> Неопределено  Тогда			
			РодительГруппы = ОписатьРодителейГруппы("", "ОтветственныйКомментарий");			
		ИначеЕсли ИмяФормы = "Документ.уатМаршрутныйЛист.Форма.ФормаДокумента" Тогда			
			РодительГруппы = ОписатьРодителейГруппы("", "ОтветственныйКоментарий");			
		КонецЕсли;
			
	ИначеЕсли ТиповаяКонфигурацияСтрока = "УФ_УНФ" Тогда
		
		Если ИмяФормы = "Документ.ПеремещениеЗапасов.Форма.ФормаДокумента"
			Или ИмяФормы = "Документ.ПриходнаяНакладная.Форма.ФормаДокумента" 
			Или ИмяФормы = "Документ.РасходнаяНакладная.Форма.ФормаДокумента" Тогда
			
			РодительГруппы = ОписатьРодителейГруппы("", "");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РодительГруппы;
	
КонецФункции

Функция ОписатьРодителейГруппы(ИмяГруппыРодитель, ИмяГруппыПеред)
	
	РодительГруппы = Новый Структура;
	РодительГруппы.Вставить("ИмяГруппыРодитель", ИмяГруппыРодитель);
	РодительГруппы.Вставить("ИмяГруппыПеред", ИмяГруппыПеред);
	
	Возврат РодительГруппы;
	
КонецФункции

Процедура СформироватьРеквизитыФормы(Форма)
	
	СтруктураРеквизитов = Новый Структура;
	
	// КонтурЛогистика_ВведенныеДокументы
	СтруктураРеквизитов.Вставить("КонтурЛогистика_ВведенныеДокументы", Новый ОписаниеТипов("СписокЗначений"));
	
	// Логин Диадок
	СтруктураРеквизитов.Вставить("КонтурЛогистика_ЛогинДиадок", Новый ОписаниеТипов("Строка"));
	СтруктураРеквизитов.Вставить("КонтурЛогистика_ЕстьПортальныеАвторизации", Новый ОписаниеТипов("Булево"));

	// Использование типов документов
	СтруктураРеквизитов.Вставить("КонтурЛогистика_ИспользуетсяТРН", Новый ОписаниеТипов("Булево"));
	СтруктураРеквизитов.Вставить("КонтурЛогистика_ИспользуетсяПутевойЛист", Новый ОписаниеТипов("Булево"));
	СтруктураРеквизитов.Вставить("КонтурЛогистика_ИспользуетсяЗаказЗаявка", Новый ОписаниеТипов("Булево"));
	
	// Наличие настроек конвертации
	СтруктураРеквизитов.Вставить("КонтурЛогистика_ЕстьНастройкаТитулаЭТрН", Новый ОписаниеТипов("Булево"));
	СтруктураРеквизитов.Вставить("КонтурЛогистика_ЕстьНастройкаТитулаПЛ", Новый ОписаниеТипов("Булево"));
	СтруктураРеквизитов.Вставить("КонтурЛогистика_ЕстьНастройкаТитулаЗЗ", Новый ОписаниеТипов("Булево"));
	
	// Отображение отключания отображения панели
	СтруктураРеквизитов.Вставить("КонтурЛогистика_ОтображатьОтключениеОтображениеПанели", Новый ОписаниеТипов("Булево"));
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьРеквизиты(Форма, СтруктураРеквизитов);
	
КонецПроцедуры

Процедура ЗаполнитьВспомогательныеДанные(Форма)
	
	Форма.КонтурЛогистика_ЛогинДиадок = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ЛогинАвторизацииДиадокАПИ");
	Форма.КонтурЛогистика_ЕстьПортальныеАвторизации = КонтурЛогистика_ОбщегоНазначенияСервер.ЕстьПортальныеАвторизации();

	Форма.КонтурЛогистика_ИспользуетсяТРН = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяТРН");
	Форма.КонтурЛогистика_ИспользуетсяПутевойЛист = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист");
	Форма.КонтурЛогистика_ИспользуетсяЗаказЗаявка = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЗаказЗаявка");
	
	КонтекстЭТрН = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, Форма.Объект.Ссылка);
	Форма.КонтурЛогистика_ЕстьНастройкаТитулаЭТрН = КонтекстЭТрН.ЕстьКонвертация;
	
	КонтекстЭПЛ = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1, Форма.Объект.Ссылка);
	Форма.КонтурЛогистика_ЕстьНастройкаТитулаПЛ = КонтекстЭПЛ.ЕстьКонвертация;
	
	КонтекстЭЗЗ = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1, Форма.Объект.Ссылка);
	Форма.КонтурЛогистика_ЕстьНастройкаТитулаЗЗ = КонтекстЭЗЗ.ЕстьКонвертация;
	
	Форма.КонтурЛогистика_ОтображатьОтключениеОтображениеПанели = (
		Не Форма.КонтурЛогистика_ЕстьНастройкаТитулаЭТрН
			И Не Форма.КонтурЛогистика_ЕстьНастройкаТитулаПЛ
			И Не Форма.КонтурЛогистика_ЕстьНастройкаТитулаЗЗ);
	
КонецПроцедуры

Процедура СформироватьПредставлениеДокументов(Форма, РодительГруппы)
	
	Если ЗначениеЗаполнено(РодительГруппы.ИмяГруппыРодитель) Тогда
		ГруппаРодитель = Форма.Элементы[РодительГруппы.ИмяГруппыРодитель];
	Иначе
		ГруппаРодитель = Форма;
	КонецЕсли;
	
	ТиповаяКонфигурацияСтрока = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	ИмяПодключаемойКоманды = "Подключаемый_ВыполнитьКоманду";
	
	// Создаем главную группу
	СвойстваГруппы = Новый Структура;
	СвойстваГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная);
	СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);
	СвойстваГруппы.Вставить("Отображение", ОтображениеОбычнойГруппы.Нет);
	ГлавнаяГруппа = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычная(
		Форма, "ГруппаКонтурЛогистика", ГруппаРодитель,,,,, СвойстваГруппы);
	Если ЗначениеЗаполнено(РодительГруппы.ИмяГруппыПеред) Тогда
		Форма.Элементы.Переместить(ГлавнаяГруппа, ГруппаРодитель, Форма.Элементы[РодительГруппы.ИмяГруппыПеред]);
	КонецЕсли;
	
	// Добавляем иконку Контур
	СвойстваДекарации = Новый Структура;
	СвойстваДекарации.Вставить("Вид", ВидДекорацииФормы.Картинка);
	СвойстваДекарации.Вставить("Картинка", БиблиотекаКартинок.КонтурЛогистика_КонтурЛого16);
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(Форма, "ДекорацияКонтур", ГлавнаяГруппа, СвойстваДекарации);
	
	Если Не ЗначениеЗаполнено(Форма.КонтурЛогистика_ЛогинДиадок)
		И Не Форма.КонтурЛогистика_ЕстьПортальныеАвторизации Тогда
		// Добавим информацию о не настроенном сервисе
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(
			Форма, "КонтурЛогистика_ДекорацияКонтурНастроитьВводЛогинаПароля",, ИмяПодключаемойКоманды);
		
		СвойстваКнопки = Новый Структура("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(
			Форма, "ДекорацияКонтурНастроить", ГлавнаяГруппа, "Настроить",
			"КонтурЛогистика_ДекорацияКонтурНастроитьВводЛогинаПароля", 2, СвойстваКнопки);
		Возврат;
	КонецЕсли;
	
	Если Не Форма.КонтурЛогистика_ИспользуетсяТРН
		И Не Форма.КонтурЛогистика_ИспользуетсяПутевойЛист
		И Не Форма.КонтурЛогистика_ИспользуетсяЗаказЗаявка Тогда
		
		// Добавим информацию о не настроенном сервисе
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(
			Форма, "КонтурЛогистика_ДекорацияКонтурНастроитьФункциональность",, ИмяПодключаемойКоманды);
		
		СвойстваКнопки = Новый Структура("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(
			Форма, "ДекорацияКонтурНастроить", ГлавнаяГруппа, "Настроить",
			"КонтурЛогистика_ДекорацияКонтурНастроитьФункциональность", 2, СвойстваКнопки);
		Возврат;
	КонецЕсли;
	
	ВведенныеДокументы = ВведенныеДокументы(Форма.Объект.Ссылка);
	
	ЕстьДокумент1 = ЗначениеЗаполнено(ВведенныеДокументы.Документ1.Ссылка);
	ЕстьДокумент2 = ЗначениеЗаполнено(ВведенныеДокументы.Документ2.Ссылка);
	
	// Документ1
	Если ЕстьДокумент1 Тогда
		ВывестиЭлементДекорации(Форма, ГлавнаяГруппа, ВведенныеДокументы.Документ1, "ДекорацияКонтурДокумент1");
	Иначе
		ЭлементДекорация = ВывестиЭлементДекорации(Форма, ГлавнаяГруппа,, "ДекорацияКонтурДокумент1");
		ЭлементДекорация.Видимость = Ложь;
	КонецЕсли;
	
	// Документ2
	Если ЕстьДокумент2 Тогда
		ВывестиЭлементДекорации(Форма, ГлавнаяГруппа, ВведенныеДокументы.Документ2, "ДекорацияКонтурДокумент2");
	Иначе
		ЭлементДекорация = ВывестиЭлементДекорации(Форма, ГлавнаяГруппа,, "ДекорацияКонтурДокумент2");
		ЭлементДекорация.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ЕстьДокумент1 И Не ЕстьДокумент2 Тогда
		
		// Оформить ЭПД
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(
			Форма, "КонтурЛогистика_ДекорацияКонтурОформить",, ИмяПодключаемойКоманды);
		
		СвойстваКнопки = Новый Структура("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(
			Форма, "ДекорацияКонтурОформить", ГлавнаяГруппа, "Оформить ЭПД", "КонтурЛогистика_ДекорацияКонтурОформить", 2, СвойстваКнопки);
		
	КонецЕсли;
	
	// Введенные документы
	Для Каждого ВведенныйДокумент Из ВведенныеДокументы.ВсеСсылки Цикл
		Форма["КонтурЛогистика_ВведенныеДокументы"].Добавить(ВведенныйДокумент);
	КонецЦикла;
	
	// Введение возможных титулов
	Если ЕстьДокумент1 Или ЕстьДокумент2 Тогда
		ВведениеВозможныхТитулов(Форма, ГлавнаяГруппа, ИмяПодключаемойКоманды, ВведенныеДокументы);
	КонецЕсли;
	
	// ДокументыЕще
	Если Форма["КонтурЛогистика_ВведенныеДокументы"].Количество() <> 0
		Или Форма.КонтурЛогистика_ОтображатьОтключениеОтображениеПанели Тогда
		
		Если ВведенныеДокументы.ДокументовЕще = 0 Тогда
			ЗаголовокДокументыЕще = "Еще...";
		Иначе
			ЗаголовокДокументыЕще = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
				"Еще %1...", Формат(ВведенныеДокументы.ДокументовЕще, "ЧДЦ=0; ЧГ="));
		КонецЕсли;
		
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(
			Форма, "КонтурЛогистика_ДекорацияКонтурЕще",, ИмяПодключаемойКоманды);
		
		СвойстваКнопки = Новый Структура("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
		СвойстваКнопки.Вставить("Отображение", ОтображениеКнопки.КартинкаИТекст);
		СвойстваКнопки.Вставить("Картинка", БиблиотекаКартинок.КонтурЛогистика_МенюТриТочки);
		СвойстваКнопки.Вставить("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
		
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(
			Форма, "ДекорацияКонтурЕще", ГлавнаяГруппа, ЗаголовокДокументыЕще, "КонтурЛогистика_ДекорацияКонтурЕще", 2, СвойстваКнопки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВведениеВозможныхТитулов(Форма, ГлавнаяГруппа, ИмяПодключаемойКоманды, ВведенныеДокументы)
	
	Для Каждого ТекущийДокумент Из ВведенныеДокументы.ВсеСсылки Цикл
		
		Если ТипЗнч(ТекущийДокумент) <> Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная")
			И ТипЗнч(ТекущийДокумент) <> Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1")
			И ТипЗнч(ТекущийДокумент) <> Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1") Тогда
			
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			ДоступныеТитулы = КонтурЛогистика_ОбработкаДокументовСервер.МожноВвестиТитулы(ТекущийДокумент);
			
			Для Каждого ТекущийТитул Из ДоступныеТитулы Цикл
				ДобавитьКомандуВведенияНовогоТитула(Форма, ГлавнаяГруппа, ИмяПодключаемойКоманды, ТекущийТитул.Ключ, ТекущийТитул.Значение);
			КонецЦикла;
			
		Исключение
			
			НичегоНеДелаем = Истина;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьКомандуВведенияНовогоТитула(Форма, ГлавнаяГруппа, ИмяПодключаемойКоманды, ПредставлениеТитула, ЗаголовокТитула)
	
	ИмяКоманды = "КонтурЛогистика_Ввести_" + ПредставлениеТитула;
	ИмяКнопки = "ДекорацияКонтурВвести" + ПредставлениеТитула;
	
	// Команда
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(
		Форма, ИмяКоманды,, ИмяПодключаемойКоманды);
	
	// Кнопка
	СвойстваКнопки = Новый Структура;
	СвойстваКнопки.Вставить("Отображение", ОтображениеКнопки.КартинкаИТекст);
	СвойстваКнопки.Вставить("Картинка", БиблиотекаКартинок.КонтурЛогистика_Пункт);
	СвойстваКнопки.Вставить("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
	
	КодКнопкиГипперсылка = 2;
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(
		Форма, ИмяКнопки, ГлавнаяГруппа, ЗаголовокТитула, ИмяКоманды, КодКнопкиГипперсылка, СвойстваКнопки);
	
КонецПроцедуры

Функция ВывестиЭлементДекорации(Форма, ГруппаРодитель, ТекущийДокумент, ИмяЭлемента)
	
	Если ТекущийДокумент = Неопределено Тогда
		ЗаголовокДекарации = "<заглушка>";
	Иначе
		ЗаголовокДекарации = ПредставлениеДокумента(ТекущийДокумент);
	КонецЕсли;
	
	// Добавляем ссылку на форму
	СвойстваДекарации = Новый Структура;
	СвойстваДекарации.Вставить("АвтоМаксимальнаяШирина", Ложь);
	СвойстваДекарации.Вставить("Заголовок", ЗаголовокДекарации);
	НовыйЭлемент = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
		Форма, ИмяЭлемента, ГруппаРодитель, СвойстваДекарации);
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция МанифестИнтеграционногоДокумента(Наименование, ИмяПредопределенногоДляРасширения)
	
	ПрефиксНастройки = ПрефиксНастройкиОтображенияПанели();
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("ИмяПредопределенногоДляРасширения", ПрефиксНастройки + ИмяПредопределенногоДляРасширения);
	Результат.Вставить("Описание", "Если настройка включена - то в форме документа """
		+ Наименование + """ выведется панель из которой можно "
		+ "сформировать новые документы или отследить статус уже введенных.");
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьНастройкаКонвертацииДляЭТРН()
	
	МассивТиповЛогистикиЭТРН = Новый Массив;
	МассивТиповЛогистикиЭТРН.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1);
	МассивТиповЛогистикиЭТРН.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2);
	МассивТиповЛогистикиЭТРН.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3);
	МассивТиповЛогистикиЭТРН.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4);
	МассивТиповЛогистикиЭТРН.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5);
	МассивТиповЛогистикиЭТРН.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6);
	МассивТиповЛогистикиЭТРН.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7);
	МассивТиповЛогистикиЭТРН.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул8);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_НастройкиКонвертацииДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов КАК КонтурЛогистика_НастройкиКонвертацииДокументов
		|ГДЕ
		|	НЕ КонтурЛогистика_НастройкиКонвертацииДокументов.ПометкаУдаления
		|	И КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокументаЛогистика В (&МассивТиповЛогистикиЭТРН)";
	
	Запрос.УстановитьПараметр("МассивТиповЛогистикиЭТРН", МассивТиповЛогистикиЭТРН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда		
		Возврат Истина;		
	Иначе		
		Возврат Ложь;		
	КонецЕсли;
		
КонецФункции

#КонецОбласти

#Область ПрисоединенныеФайлы

Функция ПрикрепитьФайлКДокументуОснования(ДвоичныеДанные, ДокументОснование, ИмяПечатнойФормы) Экспорт
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ПечатнаяФорма, Документ1С", ДвоичныеДанные, ДокументОснование);
	Результат = КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("СохранитьПечатнуюФормуЭПД", Истина, ПараметрыПМ);
	Если Результат <> Неопределено И Результат Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИмяСправочникаПрисоединенныеФайлы = ДокументОснование.Метаданные().Имя + "ПрисоединенныеФайлы";
	
	Если Метаданные.Справочники.Найти(ИмяСправочникаПрисоединенныеФайлы) <> Неопределено Тогда
		
		ПрисоединенныйФайл = НайтиФайлВПрисоединенныхФайлах(ИмяСправочникаПрисоединенныеФайлы, ДокументОснование, ИмяПечатнойФормы);
		
		МодульРаботаСФайлами = Вычислить("РаботаСФайлами");
		
		Если ЗначениеЗаполнено(ПрисоединенныйФайл) Тогда
			
			АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			
			ИнформацияОФайле = Новый Структура;
			ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", АдресФайлаВоВременномХранилище);
			ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", "");
			ИнформацияОФайле.Вставить("ИмяБезРасширения", ИмяПечатнойФормы);
			ИнформацияОФайле.Вставить("Расширение", "pdf");
			ИнформацияОФайле.Вставить("ДатаМодификацииУниверсальная", ТекущаяДатаСеанса());
			МодульРаботаСФайлами.ОбновитьФайл(ПрисоединенныйФайл, ИнформацияОФайле);
			
		Иначе
		
			ПараметрыФайла = МодульРаботаСФайлами.ПараметрыДобавленияФайла();
			ПараметрыФайла.ГруппаФайлов = "";
			ПараметрыФайла.ВладелецФайлов = ДокументОснование;
			ПараметрыФайла.ИмяБезРасширения = ИмяПечатнойФормы; ;
			ПараметрыФайла.РасширениеБезТочки = "pdf";
			ПараметрыФайла.ВремяИзмененияУниверсальное = ТекущаяДатаСеанса(); 
			
			АдресВременногоХранилищаФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			АдресВременногоХранилищаТекста = "";
			
			ПрисоединенныйФайл = МодульРаботаСФайлами.ДобавитьФайл(ПараметрыФайла,
				АдресВременногоХранилищаФайла, АдресВременногоХранилищаТекста);
			
		КонецЕсли;
			
		Возврат Истина;
		
	ИначеЕсли Метаданные.Справочники.Найти("ХранилищеДополнительнойИнформации") <> Неопределено Тогда
		
		СправочникХранилищеДополнительнойИнформации = Вычислить("Справочники.ХранилищеДополнительнойИнформации");
		
		Файл = НайтиФайлВХранилищеДополнительнойИнформации(ДокументОснование, ИмяПечатнойФормы);
		
		Если ЗначениеЗаполнено(Файл) Тогда
			
			ФайлОбъект = Файл.ПолучитьОбъект();
			ФайлОбъект.Хранилище = Новый ХранилищеЗначения(ДвоичныеДанные);
			ФайлОбъект.Записать();
			
		Иначе
		
			НовыйФайл = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
			НовыйФайл.Наименование = ИмяПечатнойФормы;
			НовыйФайл.ВидДанных = Вычислить("Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл");
			НовыйФайл.ИмяФайла = ИмяПечатнойФормы + ".pdf";
			НовыйФайл.Объект = ДокументОснование;
			НовыйФайл.Хранилище = Новый ХранилищеЗначения(ДвоичныеДанные);
			НовыйФайл.Записать();
			
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция НайтиФайлВПрисоединенныхФайлах(ИмяСправочникаПрисоединенныеФайлы, ДокументОснование, ВидЭлектронногоДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РеализацияТоваровУслугПрисоединенныеФайлы КАК РеализацияТоваровУслугПрисоединенныеФайлы
		|ГДЕ
		|	Не РеализацияТоваровУслугПрисоединенныеФайлы.ПометкаУдаления
		|	И РеализацияТоваровУслугПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
		|	И РеализацияТоваровУслугПрисоединенныеФайлы.Наименование = &Наименование";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслугПрисоединенныеФайлы", ИмяСправочникаПрисоединенныеФайлы);
	
	Запрос.УстановитьПараметр("ВладелецФайла", ДокументОснование);
	Запрос.УстановитьПараметр("Наименование", ВидЭлектронногоДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиФайлВХранилищеДополнительнойИнформации(ДокументОснование, ВидЭлектронногоДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХранилищеДополнительнойИнформации.Ссылка
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|ГДЕ
		|	ХранилищеДополнительнойИнформации.Наименование = &Наименование
		|	И ХранилищеДополнительнойИнформации.ВидДанных = &ВидДанных
		|	И ХранилищеДополнительнойИнформации.Объект = &Объект";
	
	Запрос.УстановитьПараметр("ВидДанных", Вычислить("Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл"));
	Запрос.УстановитьПараметр("Наименование", ВидЭлектронногоДокумента);
	Запрос.УстановитьПараметр("Объект", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ВызовФункцийТиповыхКонфигураций

// Вычисляет массу брутто номенклатуры на основе данных учетной системы (упаковок, едициц измерения и т.д.)
//
// Параметры:
//  СтрокаТЧТовары	 - ДокументТабличнаяЧастьСтрока	 - строка табличной части "Товары" документа основания
// 
// Возвращаемое значение:
//  Число
//
Функция МассаБрутто(СтрокаТЧТовары) Экспорт
	
	ТиповаяКонфигурацияСтрока = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	Если ТиповаяКонфигурацияСтрока = "УФ_УТ"
		Или ТиповаяКонфигурацияСтрока = "КА_2"
		Или ТиповаяКонфигурацияСтрока = "ERP_УАТ"
		Или ТиповаяКонфигурацияСтрока = "ERP" Тогда
		
		Возврат КонтурЛогистика_ИнтеграцияТиповые_УФ_УТ.МассаБрутто(СтрокаТЧТовары);
		
	ИначеЕсли ТиповаяКонфигурацияСтрока = "УТ"
		Или ТиповаяКонфигурацияСтрока = "УПП"
		Или ТиповаяКонфигурацияСтрока = "КА" Тогда
		
		Возврат КонтурЛогистика_ИнтеграцияТиповые_ОФ_УТ.МассаБрутто(СтрокаТЧТовары);
		
	КонецЕсли;
	
	Сообщить("Для конфигурации " + ТиповаяКонфигурацияСтрока + " нет функции по расчету массы брутто");
	
	Возврат 0;
	
КонецФункции

// Вычисляет количество мест номенклатуры на основе данных учетной системы (упаковок, едициц измерения и т.д.)
//
// Параметры:
//  СтрокаТЧТовары	 - ДокументТабличнаяЧастьСтрока	 - строка табличной части "Товары" документа основания
// 
// Возвращаемое значение:
//  Число
//
Функция КоличествоМест(СтрокаТЧТовары) Экспорт
	
	ТиповаяКонфигурацияСтрока = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	Если ТиповаяКонфигурацияСтрока = "УФ_УТ"
		Или ТиповаяКонфигурацияСтрока = "КА_2"
		Или ТиповаяКонфигурацияСтрока = "ERP_УАТ"
		Или ТиповаяКонфигурацияСтрока = "ERP" Тогда
		
		Возврат КонтурЛогистика_ИнтеграцияТиповые_УФ_УТ.КоличествоМест(СтрокаТЧТовары);
		
	КонецЕсли;
	
	Сообщить("Для конфигурации " + ТиповаяКонфигурацияСтрока + " нет функции по расчету количества мест");
	
	Возврат 0;
	
КонецФункции

// Вычисляет таблицу товаров с данными для печати ТОРГ12
//
// Параметры:
//  Основание	 - ДокументСсылка	 - документ основание титула
// 
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ТаблицаТоварыДляТОРГ12(Основание) Экспорт
	
	тз = Новый ТаблицаЗначений;
	
	ТиповаяКонфигурацияСтрока = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	Если ТиповаяКонфигурацияСтрока = "УФ_УТ"
		Или ТиповаяКонфигурацияСтрока = "КА_2"
		Или ТиповаяКонфигурацияСтрока = "ERP_УАТ"
		Или ТиповаяКонфигурацияСтрока = "ERP" Тогда
		Возврат КонтурЛогистика_ИнтеграцияТиповые_УФ_УТ.ТаблицаТоварыДляТОРГ12(Основание);	
	КонецЕсли;
	
	Возврат тз;
	
Конецфункции

// Получает значение колонки таблицы товаров с данными для печати ТОРГ12 по строке табличной части "Товары"
//
// Параметры:
//  ТаблицаТовары	 	 - ТаблицаЗначений	 			 - таблицы товаров с данными для печати ТОРГ12 
//  ИмяРеквизита	 	 - Строка	 					 - наименование колонки, значение которой надо получить
//  Основание	 	 	 - ДокументТабличнаяЧастьСтрока	 - строка табличной части "Товары" документа основания для которой получаем значение
//  ДокументОснование	 - ДокументСсылка	 			 - документ ссылка
// 
// Возвращаемое значение:
//  Произвольный
//
Функция ЗначениеРеквизитаТЧТоварыДляТОРГ12(ТаблицаТовары, ИмяРеквизита, Основание, ДокументОснование) Экспорт
	
	ТиповаяКонфигурацияСтрока = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	Если ТиповаяКонфигурацияСтрока = "УФ_УТ"
		Или ТиповаяКонфигурацияСтрока = "КА_2"
		Или ТиповаяКонфигурацияСтрока = "ERP_УАТ"
		Или ТиповаяКонфигурацияСтрока = "ERP" Тогда
		Возврат КонтурЛогистика_ИнтеграцияТиповые_УФ_УТ.ЗначениеРеквизитаТЧТоварыДляТОРГ12(
			ТаблицаТовары, ИмяРеквизита, Основание, ДокументОснование);	
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
